In [1]:
from sqlab.dbms.mysql.nb_tools import show_tables, col, print_assert
%config SqlMagic.dsn_filename = "cnx.ini"
%config SqlMagic.displaycon = False
%config SqlMagic.displaylimit = 0
%reload_ext sql
%sql --section cnx
show_tables()

Using the existing connection file 'mysql/cnx.ini'.

Connecting to 'cnx'

        Table                                                    Columns
0  inhabitant  personid, name, villageid, gender, job, gold, state, hash
1     village                               villageid, name, chief, hash
2        item                                          item, owner, hash
3   sqlab_msg                                                        msg

# SQL Island

## `SELECT *`

**Episode [042].**
Oh dear, what happened? It seems that I am the only survivor of the air crash. Wow, there are some villages on this island.

```sql
SELECT *
FROM village
```

**Statement.** Copy-paste the previous query. After the star `*`, add a comma and the given formula. Execute the complete query.

In [ ]:
%%sql
SELECT *,
    salt_042(sum(hash) OVER ()) AS token
FROM village
--> Episode [002]

3 rows affected.

villageid,name,chief,hash,token
1,Monkeycity,1,537616450612,279731784972193
2,Cucumbertown,6,506002862681,279731784972193
3,Onionville,13,1093234273575,279731784972193

In [ ]:
assert col("name") == ['Monkeycity', 'Cucumbertown', 'Onionville']

**Episode [002].** It seems there are a few people living in these villages.

**Statement.** How can you see a list of all inhabitants?

In [ ]:
%%sql
SELECT *,
    salt_002(sum(hash) OVER ()) AS token
FROM inhabitant
--> Episode [048]

19 rows affected.

personid,name,villageid,gender,job,gold,state,hash,token
1,Paul Bakerman,1,m,baker,850,friendly,667574576304,128589543210724
2,Ernest Perry,3,m,weaponsmith,280,friendly,73993229357,128589543210724
3,Rita Ox,1,f,baker,350,friendly,41932111594,128589543210724
4,Carl Ox,1,m,merchant,250,friendly,843473717421,128589543210724
5,Dirty Dieter,3,m,smith,650,evil,637588674311,128589543210724
6,Gerry Slaughterer,2,m,butcher,4850,evil,872618219253,128589543210724
7,Peter Slaughterer,3,m,butcher,3250,evil,648197551204,128589543210724
8,Arthur Tailor,2,m,pilot,490,kidnapped,823379478192,128589543210724
9,Tiffany Drummer,1,f,baker,550,evil,434738589188,128589543210724
10,Peter Drummer,1,m,smith,600,friendly,713565808545,128589543210724
11,Dirty Diane,3,f,farmer,10,evil,317598695175,128589543210724
12,Otto Alexander,2,m,dealer,680,friendly,371232179800,128589543210724
13,Fred Dix,3,m,author,420,friendly,865222686964,128589543210724
14,Enrico Carpenter,3,m,weaponsmith,510,evil,1052048305797,128589543210724
15,Helen Grasshead,2,f,dealer,680,friendly,618786795696,128589543210724
16,Ivy Hatter,1,f,dealer,770,evil,255939466731,128589543210724
17,Edward Grasshead,3,m,butcher,990,friendly,296311699507,128589543210724
18,Ryan Horse,3,m,blacksmith,390,friendly,98143389713,128589543210724
19,Ann Meaty,2,f,butcher,2280,friendly,889525893587,128589543210724

## `WHERE`

### Comparison operator `=`

**Episode [048].**
Woah, so many people!

Man! I'm hungry. I will go and find a butcher to ask for some free sausages.

```sql
SELECT *
FROM inhabitant
WHERE job = 'butcher'
```

**Statement.** Copy-paste the previous query, add the given formula, and execute it.

In [ ]:
%%sql
SELECT *,
    salt_048(sum(hash) OVER ()) AS token
FROM inhabitant A
WHERE job = 'butcher'
--> Episode [023]

4 rows affected.

personid,name,villageid,gender,job,gold,state,hash,token
6,Gerry Slaughterer,2,m,butcher,4850,evil,872618219253,280206676651511
7,Peter Slaughterer,3,m,butcher,3250,evil,648197551204,280206676651511
17,Edward Grasshead,3,m,butcher,990,friendly,296311699507,280206676651511
19,Ann Meaty,2,f,butcher,2280,friendly,889525893587,280206676651511

**Episode [023].**
- There you are! Enjoy your meal! But take care of yourself. As long as you are unarmed, stay away from villains. Not everyone on this island is friendly.
- Thank you, Edward!

**Statement.** Okay, let's see who is friendly on this island...

In [ ]:
%%sql
SELECT *,
    salt_023(sum(hash) OVER ()) AS token
FROM inhabitant
WHERE state = 'friendly'
--> Episode [060]

11 rows affected.

personid,name,villageid,gender,job,gold,state,hash,token
1,Paul Bakerman,1,m,baker,850,friendly,667574576304,49081739277115
2,Ernest Perry,3,m,weaponsmith,280,friendly,73993229357,49081739277115
3,Rita Ox,1,f,baker,350,friendly,41932111594,49081739277115
4,Carl Ox,1,m,merchant,250,friendly,843473717421,49081739277115
10,Peter Drummer,1,m,smith,600,friendly,713565808545,49081739277115
12,Otto Alexander,2,m,dealer,680,friendly,371232179800,49081739277115
13,Fred Dix,3,m,author,420,friendly,865222686964,49081739277115
15,Helen Grasshead,2,f,dealer,680,friendly,618786795696,49081739277115
17,Edward Grasshead,3,m,butcher,990,friendly,296311699507,49081739277115
18,Ryan Horse,3,m,blacksmith,390,friendly,98143389713,49081739277115
19,Ann Meaty,2,f,butcher,2280,friendly,889525893587,49081739277115

### Boolean operator `AND`

**Episode [060].**
There is no way around getting a sword for myself.

**Statement.** Now try to find a friendly weaponsmith to forge you one.

_Tip._ You can combine predicates in the `WHERE` clause with `AND`.

In [ ]:
%%sql
SELECT *,
    salt_060(sum(hash) OVER ()) AS token
FROM inhabitant
WHERE state = 'friendly'
    AND job = 'weaponsmith'
--> Episode [069]

1 rows affected.

personid,name,villageid,gender,job,gold,state,hash,token
2,Ernest Perry,3,m,weaponsmith,280,friendly,73993229357,111903790755050

### Comparison operator `LIKE`

**Episode [069].**
Oh, that does not look good.

**Statement.** Maybe other friendly smiths can help you out, e.g. a blacksmith.

_Tip._ Try out: job `LIKE` '%smith' to find all inhabitants whose job ends with 'smith' (% is a wildcard for any number of characters).

In [ ]:
%%sql
SELECT *,
    salt_069(sum(hash) OVER ()) AS token
FROM inhabitant
WHERE state = 'friendly'
    AND job LIKE '%smith'
--> Episode [090]

3 rows affected.

personid,name,villageid,gender,job,gold,state,hash,token
2,Ernest Perry,3,m,weaponsmith,280,friendly,73993229357,71115866585707
10,Peter Drummer,1,m,smith,600,friendly,713565808545,71115866585707
18,Ryan Horse,3,m,blacksmith,390,friendly,98143389713,71115866585707

## `INSERT`

**Episode [090].**
That looks better! I will go and visit those smiths.

– Hi stranger! Where are you going? I'm Paul, I'm the major of Monkeycity. I will go ahead and register you as a citizen.

```sql
INSERT INTO inhabitant (name, villageid, gender, job, gold, state) VALUES ('Stranger', 1, '?', '?', 0, '?')
```

– No need to call me stranger!

**Statement.** First, execute the `INSERT` query. Then, look for your personid.

_Tip._ In former queries, the * stands for: all columns. Instead of the star, you can also address one or more columns (separated by a comma) and you will only get the columns you need.

In [ ]:
%%sql
INSERT INTO inhabitant (name, villageid, gender, job, gold, state)
VALUES ('Stranger', 1, '?', '?', 0, '?');


SELECT personid,
    salt_090(sum(hash) OVER ()) AS token
FROM inhabitant
WHERE name = 'Stranger';
--> Episode [099]

1 rows affected.

1 rows affected.

personid,token
20,29896704364823

### Fixing multiple insertions of the same record

#### One duplicate

In [ ]:
%%sql
INSERT INTO inhabitant (name, villageid, gender, job, gold, state)
VALUES ('Stranger', 1, '?', '?', 0, '?')

1 rows affected.

++
||
++
++

In [ ]:
%%sql
-- Hint. Oops, it seems you have executed the `INSERT` query twice or more.
-- Execute the following queries to cancel all these insertions:
-- DELETE from inhabitant WHERE name = 'Stranger';
-- ALTER TABLE inhabitant AUTO_INCREMENT=1
SELECT personid,
    salt_090(sum(hash) OVER ()) AS token
FROM inhabitant
WHERE name = 'Stranger';

2 rows affected.

personid,token
20,29293607320320
21,29293607320320

#### Two duplicates

In [ ]:
%%sql
INSERT INTO inhabitant (name, villageid, gender, job, gold, state)
VALUES ('Stranger', 1, '?', '?', 0, '?')

1 rows affected.

++
||
++
++

In [ ]:
%%sql
-- Hint. Oops, it seems you have executed the `INSERT` query twice or more.
-- Execute the following queries to cancel all these insertions:
-- DELETE from inhabitant WHERE name = 'Stranger';
-- ALTER TABLE inhabitant AUTO_INCREMENT=1
SELECT personid,
    salt_090(sum(hash) OVER ()) AS token
FROM inhabitant
WHERE name = 'Stranger';

3 rows affected.

personid,token
20,28697173935421
21,28697173935421
22,28697173935421

#### Three duplicates

In [ ]:
%%sql
INSERT INTO inhabitant (name, villageid, gender, job, gold, state)
VALUES ('Stranger', 1, '?', '?', 0, '?')

1 rows affected.

++
||
++
++

In [ ]:
%%sql
-- Hint. Oops, it seems you have executed the `INSERT` query twice or more.
-- Execute the following queries to cancel all these insertions:
-- DELETE from inhabitant WHERE name = 'Stranger';
-- ALTER TABLE inhabitant AUTO_INCREMENT=1
SELECT personid,
    salt_090(sum(hash) OVER ()) AS token
FROM inhabitant
WHERE name = 'Stranger';

4 rows affected.

personid,token
20,28094084689710
21,28094084689710
22,28094084689710
23,28094084689710

#### Four duplicates

In [ ]:
%%sql
INSERT INTO inhabitant (name, villageid, gender, job, gold, state)
VALUES ('Stranger', 1, '?', '?', 0, '?')

1 rows affected.

++
||
++
++

In [ ]:
%%sql
-- Hint. Oops, it seems you have executed the `INSERT` query twice or more.
-- Execute the following queries to cancel all these insertions:
-- DELETE from inhabitant WHERE name = 'Stranger';
-- ALTER TABLE inhabitant AUTO_INCREMENT=1
SELECT personid,
    salt_090(sum(hash) OVER ()) AS token
FROM inhabitant
WHERE name = 'Stranger';

5 rows affected.

personid,token
20,27493202200923
21,27493202200923
22,27493202200923
23,27493202200923
24,27493202200923

#### Deduplicating

In [ ]:
%%sql
DELETE
FROM inhabitant
WHERE name = 'Stranger';


ALTER TABLE inhabitant AUTO_INCREMENT = 1;


INSERT INTO inhabitant (name, villageid, gender, job, gold, state)
VALUES ('Stranger', 1, '?', '?', 0, '?');

5 rows affected.

1 rows affected.

++
||
++
++

## `WHERE` (again)

### Comparison operator `=`

**Episode [099].**

- Hi Ernest! How much is a sword?
- I can offer to make you a sword for 150 gold. That's the cheapest you will find!

**Statement.** How much gold do you have?

In [ ]:
%%sql
SELECT gold,
    salt_099(sum(hash) OVER ()) AS token
FROM inhabitant
WHERE personid = 20
--> Episode [073]

1 rows affected.

gold,token
0,7708171354493

### `IS NULL`

**Episode [073].**
Damn! No mon, no fun. There has to be another option to earn gold other than going to work. Maybe I could collect ownerless items and sell them!

**Statement.** Make a list of all items that don't belong to anyone.

_Tip._ You can recognize ownerless items by: WHERE owner IS NULL

In [ ]:
%%sql
SELECT *,
    salt_073(sum(hash) OVER ()) AS token
FROM item
WHERE OWNER IS NULL
--> Episode [093]

6 rows affected.

item,owner,hash,token
bucket,None,184436083777,253789061748229
carton,None,456410402076,253789061748229
coffee cup,None,187016689873,253789061748229
lightbulb,None,659598942284,253789061748229
ring,None,588958498140,253789061748229
teapot,None,89763356635,253789061748229

## `UPDATE`

### `UPDATE` one row

**Episode [093].** So much cool stuff!

Yay, a coffee cup. Let's collect it!

```sql
UPDATE item
SET owner = 20
WHERE item = 'coffee cup'
```

**Statement.** Execute the `UPDATE` query, and check the `item` table afterwards.

In [ ]:
%%sql
UPDATE item
SET OWNER = 20
WHERE item = 'coffee cup';


SELECT *,
    salt_093(sum(hash) OVER ()) AS token
FROM item
--> Episode [033]

1 rows affected.

9 rows affected.

item,owner,hash,token
bucket,None,184436083777,107025105236366
cane,5,11384476511,107025105236366
carton,None,456410402076,107025105236366
coffee cup,20,635511775068,107025105236366
hammer,2,471038081064,107025105236366
lightbulb,None,659598942284,107025105236366
ring,None,588958498140,107025105236366
rope,17,538701889223,107025105236366
teapot,None,89763356635,107025105236366

### `UPDATE` several rows

**Episode [033].**

**Statement.** Do you know a trick how to collect all the ownerless items? Afterwards, list all of the items you own.

In [ ]:
%%sql
UPDATE item
SET OWNER = 20
WHERE OWNER IS NULL;


SELECT item,
    salt_033(sum(hash) OVER ()) AS token
FROM item
WHERE OWNER = 20
--> Episode [024]

5 rows affected.

6 rows affected.

item,token
bucket,139744599079637
carton,139744599079637
coffee cup,139744599079637
lightbulb,139744599079637
ring,139744599079637
teapot,139744599079637

**Episode [024].**

**Statement.** Find a friendly inhabitant who is either a dealer or a merchant. Maybe they want to buy some of your items.

_Tip._ When you use both `AND` and `OR`, don't forget to put brackets correctly!

In [ ]:
%%sql
SELECT *,
    salt_024(sum(hash) OVER ()) AS token
FROM inhabitant
WHERE state = 'friendly'
    AND (job = 'dealer'
         OR job = 'merchant')
--> Episode [034]

3 rows affected.

personid,name,villageid,gender,job,gold,state,hash,token
4,Carl Ox,1,m,merchant,250,friendly,843473717421,166788243175236
12,Otto Alexander,2,m,dealer,680,friendly,371232179800,166788243175236
15,Helen Grasshead,2,f,dealer,680,friendly,618786795696,166788243175236

**Episode [034].** I'd like to get the ring and the teapot. The rest is nothing but scrap. Please give me the two items. My `personid` is 15.

**Statement.** Afterwards, check the items that she owns.

In [ ]:
%%sql
UPDATE item
SET OWNER = 15
WHERE item = 'ring'
    OR item = 'teapot';


SELECT *,
    salt_034(sum(hash) OVER ()) AS token
FROM item
WHERE OWNER = 15
--> Episode [091]

2 rows affected.

2 rows affected.

item,owner,hash,token
ring,15,972837695337,261661938333343
teapot,15,503611185415,261661938333343

**Episode [091].**

— Thank you! Here, some gold!

**Statement.** Substract 120 from Helen's gold, add 120 to yours, and then check the new amounts of your two rows.

In [ ]:
%%sql
UPDATE inhabitant
SET gold = gold - 120
WHERE personid = 15;


UPDATE inhabitant
SET gold = gold + 120
WHERE personid = 20;


SELECT name, gold,
    salt_091(sum(hash) OVER ()) AS token
FROM inhabitant
WHERE personid IN (15, 20)
--> Episode [080]

1 rows affected.

1 rows affected.

2 rows affected.

name,gold,token
Helen Grasshead,560,34807888636366
Stranger,120,34807888636366

In [ ]:
%%sql
-- Hint. Restrict the result to the row of Helen (15) and yours (20).
SELECT name, gold,
    salt_091(sum(hash) OVER ()) AS token
FROM inhabitant

20 rows affected.

name,gold,token
Paul Bakerman,850,24919761524173
Ernest Perry,280,24919761524173
Rita Ox,350,24919761524173
Carl Ox,250,24919761524173
Dirty Dieter,650,24919761524173
Gerry Slaughterer,4850,24919761524173
Peter Slaughterer,3250,24919761524173
Arthur Tailor,490,24919761524173
Tiffany Drummer,550,24919761524173
Peter Drummer,600,24919761524173
Dirty Diane,10,24919761524173
Otto Alexander,680,24919761524173
Fred Dix,420,24919761524173
Enrico Carpenter,510,24919761524173
Helen Grasshead,560,24919761524173
Ivy Hatter,770,24919761524173
Edward Grasshead,990,24919761524173
Ryan Horse,390,24919761524173
Ann Meaty,2280,24919761524173
Stranger,120,24919761524173

**Episode [080].** Unfortunately, that's not enough gold to buy a sword. Seems like I do have to work after all. Maybe it's not a bad idea to change my name from Stranger to my real name before I will apply for a job.

**Statement.** Update your name to 'Leslie Qualls' and show the updated row.

In [ ]:
%%sql
UPDATE inhabitant
SET name = 'Leslie Qualls'
WHERE personid = 20;


SELECT *,
    salt_080(sum(hash) OVER ()) AS token
FROM inhabitant
WHERE personid = 20
--> Episode [078]

1 rows affected.

1 rows affected.

personid,name,villageid,gender,job,gold,state,hash,token
20,Leslie Qualls,1,?,?,120,?,815181808020,18314467662514

In [ ]:
%%sql
-- Hint. Restrict the result to your row (20).
SELECT *,
    salt_080(sum(hash) OVER ()) AS token
FROM inhabitant

20 rows affected.

personid,name,villageid,gender,job,gold,state,hash,token
1,Paul Bakerman,1,m,baker,850,friendly,667574576304,28691699637667
2,Ernest Perry,3,m,weaponsmith,280,friendly,73993229357,28691699637667
3,Rita Ox,1,f,baker,350,friendly,41932111594,28691699637667
4,Carl Ox,1,m,merchant,250,friendly,843473717421,28691699637667
5,Dirty Dieter,3,m,smith,650,evil,637588674311,28691699637667
6,Gerry Slaughterer,2,m,butcher,4850,evil,872618219253,28691699637667
7,Peter Slaughterer,3,m,butcher,3250,evil,648197551204,28691699637667
8,Arthur Tailor,2,m,pilot,490,kidnapped,823379478192,28691699637667
9,Tiffany Drummer,1,f,baker,550,evil,434738589188,28691699637667
10,Peter Drummer,1,m,smith,600,friendly,713565808545,28691699637667
11,Dirty Diane,3,f,farmer,10,evil,317598695175,28691699637667
12,Otto Alexander,2,m,dealer,680,friendly,371232179800,28691699637667
13,Fred Dix,3,m,author,420,friendly,865222686964,28691699637667
14,Enrico Carpenter,3,m,weaponsmith,510,evil,1052048305797,28691699637667
15,Helen Grasshead,2,f,dealer,560,friendly,335525955822,28691699637667
16,Ivy Hatter,1,f,dealer,770,evil,255939466731,28691699637667
17,Edward Grasshead,3,m,butcher,990,friendly,296311699507,28691699637667
18,Ryan Horse,3,m,blacksmith,390,friendly,98143389713,28691699637667
19,Ann Meaty,2,f,butcher,2280,friendly,889525893587,28691699637667
20,Leslie Qualls,1,?,?,120,?,815181808020,28691699637667

## `ORDER BY`

**Episode [078].**

**Statement.** Since baking is one of your hobbies, why not find a baker who you can work for?

_Tip._ List all bakers and use `ORDER BY` gold to sort the results. `ORDER BY` gold `DESC` is even better because then the richest baker is on top.

In [ ]:
x = 850 # gold on the first row

In [ ]:
%%sql
SELECT *,
    salt_078({{x}} + sum(hash) OVER ()) AS token
FROM inhabitant
WHERE job = 'baker'
ORDER BY gold DESC
--> Episode [010]

3 rows affected.

personid,name,villageid,gender,job,gold,state,hash,token
1,Paul Bakerman,1,m,baker,850,friendly,667574576304,34285849059910
9,Tiffany Drummer,1,f,baker,550,evil,434738589188,34285849059910
3,Rita Ox,1,f,baker,350,friendly,41932111594,34285849059910

In [ ]:
assert col("gold")[0] == x

**Episode [010].** Aha, Paul! I know him!

– Hi, you again! I saw you want to work as a baker? Okay! You will be paid 1 gold for 100 bread rolls.

(8 hours later...)

– Here, I made ten thousand bread rolls! I quit! This should be enough money to buy a sword. Let's see what happens with my gold balance.

Here's your new sword, Losloo Qoolls! Now you can go everywhere.

**Statement.** Update your gold by adding your salary (100) and substracting the price of the sword (150).

In [ ]:
%%sql
UPDATE inhabitant
SET gold = gold + 100 - 150
WHERE personid = 20;


SELECT name, gold,
    salt_010(sum(hash) OVER ()) AS token
FROM inhabitant
WHERE personid = 20
--> Episode [086]

1 rows affected.

1 rows affected.

name,gold,token
Leslie Qualls,70,157095709958947

**Episode [086].**

– My name is Leslie qualls! Thanks anyway!

**Statement.** Is there a pilot on this island by any chance? He could fly you home.

In [ ]:
%%sql
SELECT *,
    salt_086(sum(hash) OVER ()) AS token
FROM inhabitant
WHERE job = 'pilot'
--> Episode [029]

1 rows affected.

personid,name,villageid,gender,job,gold,state,hash,token
8,Arthur Tailor,2,m,pilot,490,kidnapped,823379478192,229615318980909

## Joins

**Episode [029].** Oh no, his state is 'kidnapped'.

Horrible, the pilot is held captive by Dirty Dieter! I will show you a trick how to find out the name of the village where Dirty Dieter lives.

```sql
SELECT A.name
FROM village A, inhabitant B
WHERE A.villageid = B.villageid AND B.name = 'Dirty Dieter'
```

**Statement.** Copy-paste the previous query, add the given formula, and execute it.

In [ ]:
%%sql
-- The expression presented here is called a join. It combines the information of the `inhabitant` table with
-- information of the `village` table by matching `villageid` values.
SELECT A.name,
    salt_029(sum(A.hash + B.hash) OVER ()) AS token
FROM village A, inhabitant B
WHERE A.villageid = B.villageid
    AND B.name = 'Dirty Dieter'
--> Episode [045]

1 rows affected.

name,token
Onionville,256975312978711

**Episode [045].**

– Thanks for the hint!

**Statement.** Use the join to find out the chief's name of the village Onionville.

_Tip._ In the column `chief` in the village table, the `personid` of the chief is stored.

In [ ]:
%%sql
SELECT B.name,
    salt_045(sum(A.hash + B.hash) OVER ()) AS token
FROM village A, inhabitant B
WHERE A.chief = B.personid
    AND A.name = 'Onionville'
--> Episode [012]

1 rows affected.

name,token
Fred Dix,240365303417698

In [ ]:
assert col("name") == ["Fred Dix"]

## `COUNT(*)`

**Episode [012].** I've got it! I will visit Fred and ask him about Dirty Dieter and the pilot.

Um, how many inhabitants does Onionville have?

```sql
SELECT COUNT(*) as population
FROM inhabitant A, village B
WHERE A.villageid = B.villageid
AND B.name = 'Onionville'
```

**Statement.** Copy-paste the previous query, add the given formula, and execute it.

In [ ]:
x = 8 # this number

In [ ]:
%%sql
SELECT count(*) AS population,
    salt_012({{x}} + sum(bit_xor(A.hash + B.hash)) OVER ()) AS token
FROM inhabitant A, village B
WHERE A.villageid = B.villageid
    AND B.name = 'Onionville'
--> Episode [032]

1 rows affected.

population,token
8,237781870732904

In [ ]:
assert col("population") == [x]

**Episode [032].**

– Hello Leslie Qualls, the pilot is held captive by Dirty Dieter in his sister's house.

**Statement.** Shall I tell you how many women there are in Onionville? Nah, you can figure it out by yourself!

_Tip._ Women show up as gender = 'f'.

In [ ]:
x = 1 # this number

In [ ]:
%%sql
SELECT count(*) AS women,
    salt_032({{x}} + sum(bit_xor(A.hash + B.hash)) OVER ()) AS token
FROM inhabitant A, village B
WHERE A.villageid = B.villageid
    AND B.name = 'Onionville'
    AND gender = 'f'
--> Episode [036]

1 rows affected.

women,token
1,41535988500868

In [ ]:
assert col("women") == [x]

**Episode [036].** Oh, only one woman.

**Statement.** What's her name?

In [ ]:
%%sql
SELECT A.name,
    salt_036(sum(A.hash + B.hash) OVER ()) AS token
FROM inhabitant A, village B
WHERE A.villageid = B.villageid
    AND B.name = 'Onionville'
    AND gender = 'f'
--> Episode [035]

1 rows affected.

name,token
Dirty Diane,124493698100759

In [ ]:
assert col("name") == ['Dirty Diane']

## `SUM()`

**Episode [035].** Let's go!

– Leslie Qualls, if you hand me over the entire property of our nearby village Cucumbertown, I will release the pilot. I will show you now what this property consists of.

```sql
SELECT SUM(A.gold) as total
FROM inhabitant A, village B
WHERE A.villageid = B.villageid
AND B.name = 'Cucumbertown'
```

**Statement.** Copy-paste the previous query, add the given formula, and execute it.

In [ ]:
x = 8860 # this sum

In [ ]:
%%sql
SELECT sum(A.gold) AS total,
    salt_035({{x}} + sum(bit_xor(A.hash + B.hash)) OVER ()) AS token
FROM inhabitant A, village B
WHERE A.villageid = B.villageid
    AND B.name = 'Cucumbertown'
--> Episode [046]

1 rows affected.

total,token
8860,152867079389134

In [ ]:
assert col("total") == [x]

**Episode [046].** Oh no, baking bread alone can't solve my problems. If I continue working and selling items though, I could earn more gold than the worth of gold inventories of all bakers, dealers and merchants together.

**Statement.** Sum the gold of all these people.

In [ ]:
x = 4010 # this sum

In [ ]:
%%sql
SELECT sum(inhabitant.gold) AS total,
    salt_046({{x}} + sum(bit_xor(hash)) OVER ()) AS token
FROM inhabitant
WHERE job IN ('baker', 'dealer', 'merchant')
--> Episode [071]

1 rows affected.

total,token
4010,203716599638991

In [ ]:
assert col("total") == [x]

## `AVG()`

**Episode [071].** That's not enough.

Let's have a look at how much average gold people own, depending on their job.

```sql
SELECT job, avg(gold)
FROM inhabitant
GROUP BY job
ORDER BY avg(gold)
```

**Statement.** Copy-paste the previous query, add the given formula, and execute it.

In [ ]:
x = 2842.5000 # the average on the last row

In [ ]:
%%sql
SELECT job, avg(gold) AS average,
    salt_071({{x}} + sum(bit_xor(hash)) OVER ()) AS token
FROM inhabitant
GROUP BY job
ORDER BY average
--> Episode [018]

11 rows affected.

job,average,token
farmer,10.0000,222167811363863
?,70.0000,222167811363863
merchant,250.0000,222167811363863
blacksmith,390.0000,222167811363863
weaponsmith,395.0000,222167811363863
author,420.0000,222167811363863
pilot,490.0000,222167811363863
baker,583.3333,222167811363863
smith,625.0000,222167811363863
dealer,670.0000,222167811363863
butcher,2842.5000,222167811363863

In [ ]:
assert col("average")[-1] == x

## `DELETE`

**Episode [018].** Ok, so the only way is to mug the villains. Or I might as well go ahead and just kill Dirty Dieter with my sword!

```sql
DELETE FROM inhabitant
WHERE name = 'Dirty Dieter'
```

**Statement.** Execute the previous query. Which item is now ownerless?

In [ ]:
%%sql
DELETE
FROM inhabitant
WHERE name = 'Dirty Dieter';


SELECT item,
    salt_018(sum(hash) OVER ()) AS token
FROM item
WHERE OWNER IS NULL
--> Episode [004]

1 rows affected.

1 rows affected.

item,token
cane,193619246200652

In [ ]:
assert col("item") == ['cane']

**Episode [004].** Dirty Diane: Heeeey! Now I'm very angry!

What will you do next, Leslie Qualls?

**Statement.** Delete Dirty Diane, and show the table `inhabitant`.

In [ ]:
%%sql
DELETE
FROM inhabitant
WHERE name = 'Dirty Diane';


SELECT *,
    salt_004(sum(hash) OVER ()) AS token
FROM inhabitant
--> Episode [051]

1 rows affected.

18 rows affected.

personid,name,villageid,gender,job,gold,state,hash,token
1,Paul Bakerman,1,m,baker,850,friendly,667574576304,67594779315675
2,Ernest Perry,3,m,weaponsmith,280,friendly,73993229357,67594779315675
3,Rita Ox,1,f,baker,350,friendly,41932111594,67594779315675
4,Carl Ox,1,m,merchant,250,friendly,843473717421,67594779315675
6,Gerry Slaughterer,2,m,butcher,4850,evil,872618219253,67594779315675
7,Peter Slaughterer,3,m,butcher,3250,evil,648197551204,67594779315675
8,Arthur Tailor,2,m,pilot,490,kidnapped,823379478192,67594779315675
9,Tiffany Drummer,1,f,baker,550,evil,434738589188,67594779315675
10,Peter Drummer,1,m,smith,600,friendly,713565808545,67594779315675
12,Otto Alexander,2,m,dealer,680,friendly,371232179800,67594779315675
13,Fred Dix,3,m,author,420,friendly,865222686964,67594779315675
14,Enrico Carpenter,3,m,weaponsmith,510,evil,1052048305797,67594779315675
15,Helen Grasshead,2,f,dealer,560,friendly,335525955822,67594779315675
16,Ivy Hatter,1,f,dealer,770,evil,255939466731,67594779315675
17,Edward Grasshead,3,m,butcher,990,friendly,296311699507,67594779315675
18,Ryan Horse,3,m,blacksmith,390,friendly,98143389713,67594779315675
19,Ann Meaty,2,f,butcher,2280,friendly,889525893587,67594779315675
20,Leslie Qualls,1,?,?,70,?,614837190287,67594779315675

In [ ]:
assert "Dirty Diane" not in col("name")

## Epilog

**Episode [051].**

– Yeah! Now I release the pilot!<br>
– Thank's for releasing me, Leslie Qualls! I will fly you home!<br>
– I take my sword, some gold and lots of useless items with me as a souvenir.

**Statement.** Change the pilot's status to 'friendly', your own status to 'emigrated', and show the table `inhabitant`.

In [ ]:
%%sql
UPDATE inhabitant
SET state = 'emigrated'
WHERE personid = 20;


UPDATE inhabitant
SET state = 'friendly'
WHERE job = 'pilot';


SELECT *,
    salt_051(sum(hash) OVER ()) AS token
FROM inhabitant;
--> Episode [049]

1 rows affected.

1 rows affected.

18 rows affected.

personid,name,villageid,gender,job,gold,state,hash,token
1,Paul Bakerman,1,m,baker,850,friendly,667574576304,226162284926311
2,Ernest Perry,3,m,weaponsmith,280,friendly,73993229357,226162284926311
3,Rita Ox,1,f,baker,350,friendly,41932111594,226162284926311
4,Carl Ox,1,m,merchant,250,friendly,843473717421,226162284926311
6,Gerry Slaughterer,2,m,butcher,4850,evil,872618219253,226162284926311
7,Peter Slaughterer,3,m,butcher,3250,evil,648197551204,226162284926311
8,Arthur Tailor,2,m,pilot,490,friendly,162008019122,226162284926311
9,Tiffany Drummer,1,f,baker,550,evil,434738589188,226162284926311
10,Peter Drummer,1,m,smith,600,friendly,713565808545,226162284926311
12,Otto Alexander,2,m,dealer,680,friendly,371232179800,226162284926311
13,Fred Dix,3,m,author,420,friendly,865222686964,226162284926311
14,Enrico Carpenter,3,m,weaponsmith,510,evil,1052048305797,226162284926311
15,Helen Grasshead,2,f,dealer,560,friendly,335525955822,226162284926311
16,Ivy Hatter,1,f,dealer,770,evil,255939466731,226162284926311
17,Edward Grasshead,3,m,butcher,990,friendly,296311699507,226162284926311
18,Ryan Horse,3,m,blacksmith,390,friendly,98143389713,226162284926311
19,Ann Meaty,2,f,butcher,2280,friendly,889525893587,226162284926311
20,Leslie Qualls,1,?,?,70,emigrated,936715302546,226162284926311

**Episode [049].** You have completed SQL Island. What a big adventure!